cf/DataProcessors/ФормированиеЗаказаПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеЗаказаПоставщику</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АссортиментнаяМатрица</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентСтраховогоЗапаса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцЗаказа</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производители</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СформированныйЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦентральныйСклад</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦиклЗаказаФилиал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦиклЗаказаЦентр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦиклПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийОстатокЦентральныйСклад</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/InformationRegisters/ПрогнозСпроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПрогнозСпроса</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Январь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Февраль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Март</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Апрель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Май</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Июнь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Июль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Август</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сентябрь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Октябрь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ноябрь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Декабрь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/DataProcessors/ФормированиеЗаказаПоставщику/Forms/Форма/Ext/Form/Module.bsl
// На клиенте
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	
		ЗаполнитьНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаказПоставщику(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьФормироватьЗаказПоставщику", ЭтаФорма, Параметры);
	ПоказатьВопрос(ОписаниеОповещения, "Сформировать Заказ поставщику?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
		
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьФормироватьЗаказПоставщику(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Если СформироватьЗаказПоставщикуНаСервере() Тогда
	
			Сообщить("Сформирован документ " + Объект.СформированныйЗаказПоставщику + "!");
			
			СтруктураКолонокТовары = ФункцииФормДокументов.ПолучитьСтруктуруКолонокТовары(Элементы.Товары, Истина, ,,, , Истина);
			ФункцииФормДокументов.НоменклатураПриИзменении(Элементы.Товары, СтруктураКолонокТовары,,,, Истина);

		Иначе
			
			ПоказатьПредупреждение(, "Документ НЕ сформирован!");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// На сервере
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Производители"));
	
	Объект.Производители.ТипЗначения = Новый ОписаниеТипов(МассивТипов);
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
	
	Объект.Номенклатура.ТипЗначения = Новый ОписаниеТипов(МассивТипов);
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Склады"));
	
	Объект.ЦентральныйСклад.ТипЗначения = Новый ОписаниеТипов(МассивТипов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПрогнозСпросаСрезПоследних.Склад,
	|	ПрогнозСпросаСрезПоследних.Номенклатура,
	|	СУММА(ПрогнозСпросаСрезПоследних.Январь) КАК Январь,
	|	СУММА(ПрогнозСпросаСрезПоследних.Февраль) КАК Февраль,
	|	СУММА(ПрогнозСпросаСрезПоследних.Март) КАК Март,
	|	СУММА(ПрогнозСпросаСрезПоследних.Апрель) КАК Апрель,
	|	СУММА(ПрогнозСпросаСрезПоследних.Май) КАК Май,
	|	СУММА(ПрогнозСпросаСрезПоследних.Июнь) КАК Июнь,
	|	СУММА(ПрогнозСпросаСрезПоследних.Июль) КАК Июль,
	|	СУММА(ПрогнозСпросаСрезПоследних.Август) КАК Август,
	|	СУММА(ПрогнозСпросаСрезПоследних.Сентябрь) КАК Сентябрь,
	|	СУММА(ПрогнозСпросаСрезПоследних.Октябрь) КАК Октябрь,
	|	СУММА(ПрогнозСпросаСрезПоследних.Ноябрь) КАК Ноябрь,
	|	СУММА(ПрогнозСпросаСрезПоследних.Декабрь) КАК Декабрь
	|ПОМЕСТИТЬ втДанныеПрогноза
	|ИЗ
	|	РегистрСведений.ПрогнозСпроса.СрезПоследних(, 
	|			" + ?(Объект.Номенклатура.Количество() > 0, "Номенклатура В (&Номенклатура)", "") + ") КАК ПрогнозСпросаСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрогнозСпросаСрезПоследних.Склад,
	|	ПрогнозСпросаСрезПоследних.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПрогнозСпросаСрезПоследних.Склад,
	|	ПрогнозСпросаСрезПоследних.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Склад КАК Склад,
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток
	|ПОМЕСТИТЬ втОстаткиТоваров
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, ) КАК ТоварыНаСкладахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДанныеПрогноза КАК втДанныеПрогноза
	|		ПО ТоварыНаСкладахОстатки.Склад = втДанныеПрогноза.Склад
	|			И ТоварыНаСкладахОстатки.Номенклатура = втДанныеПрогноза.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Склад,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) КАК Склад,
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ втОстаткиТоваровЦентральныйСклад
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад В (&ЦентральныйСклад)) КАК ТоварыНаСкладахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			втДанныеПрогноза.Номенклатура КАК Номенклатура
	|		ИЗ
	|			втДанныеПрогноза КАК втДанныеПрогноза) КАК втДанныеПрогноза
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = втДанныеПрогноза.Номенклатура
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Склад,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеПрогноза.Склад,
	|	втДанныеПрогноза.Номенклатура,
	|	втДанныеПрогноза.Январь,
	|	втДанныеПрогноза.Февраль,
	|	втДанныеПрогноза.Март,
	|	втДанныеПрогноза.Апрель,
	|	втДанныеПрогноза.Май,
	|	втДанныеПрогноза.Июнь,
	|	втДанныеПрогноза.Июль,
	|	втДанныеПрогноза.Август,
	|	втДанныеПрогноза.Сентябрь,
	|	втДанныеПрогноза.Октябрь,
	|	втДанныеПрогноза.Ноябрь,
	|	втДанныеПрогноза.Декабрь,
	|	ЕСТЬNULL(втОстаткиТоваров.КоличествоОстаток, 0) КАК ТекущийОстаток,
	|	ЕСТЬNULL(втОстаткиТоваров.КоличествоОстаток, 0) КАК ТекущийОстатокНаЦентральномСкладе
	|ИЗ
	|	втДанныеПрогноза КАК втДанныеПрогноза
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиТоваров КАК втОстаткиТоваров
	|		ПО втДанныеПрогноза.Склад = втОстаткиТоваров.Склад
	|			И втДанныеПрогноза.Номенклатура = втОстаткиТоваров.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиТоваровЦентральныйСклад КАК втОстаткиТоваровЦентральныйСклад
	|		ПО втДанныеПрогноза.Склад = втОстаткиТоваровЦентральныйСклад.Склад
	|			И втДанныеПрогноза.Номенклатура = втОстаткиТоваровЦентральныйСклад.Номенклатура";
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Номенклатура", Объект.Номенклатура);
	Запрос.УстановитьПараметр("ЦентральныйСклад", Объект.ЦентральныйСклад);
	
	КоличествоДнейОтЗаказаДоПрихода = Объект.ЦиклЗаказаЦентр + Объект.ЦиклЗаказаФилиал + Объект.ЦиклПоставки;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ПервыйПроход = Истина;
		врСуммаПрогнозныхЗначений = 0;
		
		Пока НЕ КоличествоДнейОтЗаказаДоПрихода = 0 Цикл 
			
			Если ПервыйПроход Тогда
				ТекущийМесяц = МЕСЯЦ(ТекущаяДата());
			Иначе
				ТекущийМесяц = ТекущийМесяц + 1;
				ПервыйПроход = Ложь;
			КонецЕсли;
			
			СтруктураВозврата = ПолучитьДанныеДляРасчета(Выборка, ТекущийМесяц, КоличествоДнейОтЗаказаДоПрихода);
			
			врСуммаПрогнозныхЗначений = врСуммаПрогнозныхЗначений + (СтруктураВозврата.ОбъемЗаказа * СтруктураВозврата.КоличествоДнейДляРаспределения);
			
			КоличествоДнейОтЗаказаДоПрихода = КоличествоДнейОтЗаказаДоПрихода - СтруктураВозврата.КоличествоДнейДляРаспределения;
		
		КонецЦикла;
			
		//Рзф = Выборка.КоличествоСпросаФилиал * (Объект.ЦиклЗаказаФилиал + Объект.ЦиклПоставки);
		//РЗц = Выборка.КоличествоСпросаЦентр * Объект.ЦиклЗаказаЦентр;
		//Рз = РЗц + Рзф;
		//ОбъемЗаказа = Рз * Объект.КоэффициентСтраховогоЗапаса;
		
		Если врСуммаПрогнозныхЗначений > 0 Тогда
		
			НСтр = Объект.Товары.Добавить();
			НСтр.Номенклатура	= Выборка.Номенклатура;
			НСтр.Количество		= врСуммаПрогнозныхЗначений;
			НСтр.ТекущийОстаток	= Выборка.ТекущийОстаток;
			НСтр.ТекущийОстатокЦентральныйСклад	= Выборка.ТекущийОстатокНаЦентральномСкладе;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляРасчета(Выборка, ТекущийМесяц, КоличествоДнейДляРаспределения)
	
	СтруктураВозврата = Новый Структура;
	
	ОбъемЗаказа = 0;
	КоличествоДнейВТекущемМесяце = 0;
	
	Если ТекущийМесяц = 1 Тогда
		ОбъемЗаказа = Выборка.Январь * Объект.КоэффициентСтраховогоЗапаса;
		Если МЕСЯЦ(ТекущаяДата()) = 1 Тогда
			КоличествоДнейВТекущемМесяце = ДЕНЬ(КонецМесяца(ТекущаяДата())) - ДЕНЬ(ТекущаяДата());
		Иначе
			КоличествоДнейВТекущемМесяце = 31;
		КонецЕсли;
		КоличествоДнейДляРаспределения = ?(КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце > 0, КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце, КоличествоДнейДляРаспределения);
	КонецЕсли;
	Если ТекущийМесяц = 2 Тогда
		ОбъемЗаказа = Выборка.Февраль * Объект.КоэффициентСтраховогоЗапаса;
		Если МЕСЯЦ(ТекущаяДата()) = 2 Тогда
			КоличествоДнейВТекущемМесяце = ДЕНЬ(КонецМесяца(ТекущаяДата())) - ДЕНЬ(ТекущаяДата());
		Иначе
			КоличествоДнейВТекущемМесяце = 28;
		КонецЕсли;
		КоличествоДнейДляРаспределения = ?(КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце > 0, КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце, КоличествоДнейДляРаспределения);
	КонецЕсли;
	Если ТекущийМесяц = 3 Тогда
		ОбъемЗаказа = Выборка.Март * Объект.КоэффициентСтраховогоЗапаса;
		Если МЕСЯЦ(ТекущаяДата()) = 3 Тогда
			КоличествоДнейВТекущемМесяце = ДЕНЬ(КонецМесяца(ТекущаяДата())) - ДЕНЬ(ТекущаяДата());
		Иначе
			КоличествоДнейВТекущемМесяце = 31;
		КонецЕсли;
		КоличествоДнейДляРаспределения = ?(КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце > 0, КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце, КоличествоДнейДляРаспределения);
	КонецЕсли;
	Если ТекущийМесяц = 4 Тогда
		ОбъемЗаказа = Выборка.Апрель * Объект.КоэффициентСтраховогоЗапаса;
		Если МЕСЯЦ(ТекущаяДата()) = 4 Тогда
			КоличествоДнейВТекущемМесяце = ДЕНЬ(КонецМесяца(ТекущаяДата())) - ДЕНЬ(ТекущаяДата());
		Иначе
			КоличествоДнейВТекущемМесяце = 30;
		КонецЕсли;
		КоличествоДнейДляРаспределения = ?(КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце > 0, КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце, КоличествоДнейДляРаспределения);
	КонецЕсли;
	Если ТекущийМесяц = 5 Тогда
		ОбъемЗаказа = Выборка.Май * Объект.КоэффициентСтраховогоЗапаса;
		Если МЕСЯЦ(ТекущаяДата()) = 5 Тогда
			КоличествоДнейВТекущемМесяце = ДЕНЬ(КонецМесяца(ТекущаяДата())) - ДЕНЬ(ТекущаяДата());
		Иначе
			КоличествоДнейВТекущемМесяце = 31;
		КонецЕсли;
		КоличествоДнейДляРаспределения = ?(КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце > 0, КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце, КоличествоДнейДляРаспределения);
	КонецЕсли;
	Если ТекущийМесяц = 6 Тогда
		ОбъемЗаказа = Выборка.Июнь * Объект.КоэффициентСтраховогоЗапаса;
		Если МЕСЯЦ(ТекущаяДата()) = 6 Тогда
			КоличествоДнейВТекущемМесяце = ДЕНЬ(КонецМесяца(ТекущаяДата())) - ДЕНЬ(ТекущаяДата());
		Иначе
			КоличествоДнейВТекущемМесяце = 30;
		КонецЕсли;
		КоличествоДнейДляРаспределения = ?(КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце > 0, КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце, КоличествоДнейДляРаспределения);
	КонецЕсли;
	Если ТекущийМесяц = 7 Тогда
		ОбъемЗаказа = Выборка.Июль * Объект.КоэффициентСтраховогоЗапаса;
		Если МЕСЯЦ(ТекущаяДата()) = 7 Тогда
			КоличествоДнейВТекущемМесяце = ДЕНЬ(КонецМесяца(ТекущаяДата())) - ДЕНЬ(ТекущаяДата());
		Иначе
			КоличествоДнейВТекущемМесяце = 31;
		КонецЕсли;
		КоличествоДнейДляРаспределения = ?(КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце > 0, КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце, КоличествоДнейДляРаспределения);
	КонецЕсли;
	Если ТекущийМесяц = 8 Тогда
		ОбъемЗаказа = Выборка.Август * Объект.КоэффициентСтраховогоЗапаса;
		Если МЕСЯЦ(ТекущаяДата()) = 8 Тогда
			КоличествоДнейВТекущемМесяце = ДЕНЬ(КонецМесяца(ТекущаяДата())) - ДЕНЬ(ТекущаяДата());
		Иначе
			КоличествоДнейВТекущемМесяце = 31;
		КонецЕсли;
		КоличествоДнейДляРаспределения = ?(КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце > 0, КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце, КоличествоДнейДляРаспределения);
	КонецЕсли;
	Если ТекущийМесяц = 9 Тогда
		ОбъемЗаказа = Выборка.Сентябрь * Объект.КоэффициентСтраховогоЗапаса;
		Если МЕСЯЦ(ТекущаяДата()) = 9 Тогда
			КоличествоДнейВТекущемМесяце = ДЕНЬ(КонецМесяца(ТекущаяДата())) - ДЕНЬ(ТекущаяДата());
		Иначе
			КоличествоДнейВТекущемМесяце = 30;
		КонецЕсли;
		КоличествоДнейДляРаспределения = ?(КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце > 0, КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце, КоличествоДнейДляРаспределения);
	КонецЕсли;
	Если ТекущийМесяц = 10 Тогда
		ОбъемЗаказа = Выборка.Октябрь * Объект.КоэффициентСтраховогоЗапаса;
		Если МЕСЯЦ(ТекущаяДата()) = 10 Тогда
			КоличествоДнейВТекущемМесяце = ДЕНЬ(КонецМесяца(ТекущаяДата())) - ДЕНЬ(ТекущаяДата());
		Иначе
			КоличествоДнейВТекущемМесяце = 31;
		КонецЕсли;
		КоличествоДнейДляРаспределения = ?(КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце > 0, КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце, КоличествоДнейДляРаспределения);
	КонецЕсли;
	Если ТекущийМесяц = 11 Тогда
		ОбъемЗаказа = Выборка.Ноябрь * Объект.КоэффициентСтраховогоЗапаса;
		Если МЕСЯЦ(ТекущаяДата()) = 11 Тогда
			КоличествоДнейВТекущемМесяце = ДЕНЬ(КонецМесяца(ТекущаяДата())) - ДЕНЬ(ТекущаяДата());
		Иначе
			КоличествоДнейВТекущемМесяце = 30;
		КонецЕсли;
		КоличествоДнейДляРаспределения = ?(КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце > 0, КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце, КоличествоДнейДляРаспределения);
	КонецЕсли;
	Если ТекущийМесяц = 12 Тогда
		ОбъемЗаказа = Выборка.Декабрь * Объект.КоэффициентСтраховогоЗапаса;
		Если МЕСЯЦ(ТекущаяДата()) = 12 Тогда
			КоличествоДнейВТекущемМесяце = ДЕНЬ(КонецМесяца(ТекущаяДата())) - ДЕНЬ(ТекущаяДата());
		Иначе
			КоличествоДнейВТекущемМесяце = 31;
		КонецЕсли;
		КоличествоДнейДляРаспределения = ?(КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце > 0, КоличествоДнейДляРаспределения - КоличествоДнейВТекущемМесяце, КоличествоДнейДляРаспределения);
	КонецЕсли;
	
	СтруктураВозврата.Вставить("ОбъемЗаказа", ОбъемЗаказа);
	СтруктураВозврата.Вставить("КоличествоДнейДляРаспределения", КоличествоДнейДляРаспределения);
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Функция СформироватьЗаказПоставщикуНаСервере()
	
	ДокументСформирован = Ложь;
	
	НДок = Документы.ЗаказПоставщику.СоздатьДокумент();
	НДок.Дата = ТекущаяДата();
	НДок.Организация = Объект.Организация;
	НДок.Контрагент = Объект.Поставщик;
	НДок.Партнер = Объект.Поставщик;
	НДок.Склад = Объект.ЦентральныйСклад[0];
	
	Для Каждого Стр из Объект.Товары Цикл
		НСтр = НДок.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НСтр, Стр);
		НСтр.Количество = Стр.Количество - Стр.ТекущийОстаток - Стр.ТекущийОстатокЦентральныйСклад;
	КонецЦикла;	
	
	НДок.ОбменДанными.Загрузка = Истина;
	НДок.Записать(РежимЗаписиДокумента.Запись);
	
	ДокументСформирован = Истина;		
	
	Возврат ДокументСформирован;
	
КонецФункции
